In [14]:
# Dependencies
import pandas as pd
import json
from sklearn import preprocessing

In [15]:
# load json file
with open('GWDC201805DATA3-Class-Repository-DATA/Homework/04-Numpy-Pandas/Instructions/HeroesOfPymoli/purchase_data.json') as f:
    data = json.load(f)

In [16]:
my_file=pd.DataFrame(data)
my_file.head()

,Age,Gender,Item ID,Item Name,Price,SN
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46
2,34,Male,174,Primitive Blade,2.46,Assastnya25
3,21,Male,92,Final Critic,1.36,Pheusrical25
4,23,Male,63,Stormfury Mace,1.27,Aela59

In [17]:
# Check to see if there are any rows with missing data
my_file.count()

Age          780
Gender       780
Item ID      780
Item Name    780
Price        780
SN           780
dtype: int64

In [18]:
#Number of unique items
num=my_file["Item Name"].value_counts()
len(num)

179

In [19]:
# Average purchase price
average= my_file["Price"].mean()
average

2.931192307692303

In [20]:
# Total Number of purchase
num_per=my_file["Price"].count()
num_per

780

In [21]:
# Total Revenue
total=my_file["Price"].sum()
total

2286.33

In [22]:
#Gender demographics

count_gender=my_file["Gender"].value_counts()
tcount_gender=count_gender.sum()
tmcount_gender=count_gender["Male"].sum()
tfcount_gender=count_gender["Female"].sum()
tocount_gender=count_gender["Other / Non-Disclosed"].sum()
per_male=(tmcount_gender/tcount_gender)*100
per_female=(tfcount_gender/tcount_gender)*100
per_o=(tocount_gender/tcount_gender)*100

frame_df = pd.DataFrame({
    "Gender": ["Male", "Female", "Other/Undisclosed"],
    "Total": [tmcount_gender,tfcount_gender , tocount_gender],
    "Percentile": [per_male,per_female ,per_o ]
})
frame_df

              Gender  Total  Percentile
0               Male    633   81.153846
1             Female    136   17.435897
2  Other/Undisclosed     11    1.410256

In [23]:
#Gender demographics
only_male=my_file.loc[my_file["Gender"]=="Male",:]
only_female=my_file.loc[my_file["Gender"]=="Female",:]
only_other=my_file.loc[my_file["Gender"]=="Other / Non-Disclosed",:]

In [24]:
#purchase count
num_male=only_male["Price"].count()
num_female=only_female["Price"].count()
num_other=only_other["Price"].count()
print("purchase count for male:" , num_male )
print("purchase count for female:" ,num_female )
print ("purchase count for Other & non disclosed:" , num_other)

purchase count for male: 633
purchase count for female: 136
purchase count for Other & non disclosed: 11

In [25]:
#Average purchase per Gender
average_male= only_male["Price"].mean()
average_female= only_female["Price"].mean()
average_other= only_other["Price"].mean()
print("Average purchase price for male :",average_male)
print("Average purchase price for Female :",average_female)
print("Average purchase price for Other & non disclosed :",average_other)

Average purchase price for male : 2.9505213270142154
Average purchase price for Female : 2.815514705882352
Average purchase price for Other & non disclosed : 3.2490909090909086

In [26]:
#create a data frame for the normalised total for each gender
df8=my_file.loc[(my_file["Gender"]=="Male")]
df9= my_file.loc[(my_file["Gender"]=="Female")]

In [27]:
# Create x, where x the 'scores' column's values as floats
x= df8[["Price"]].values.astype(float)

# Create a minimum and maximum processor object
min_max_scaler = preprocessing.MinMaxScaler()

# Create an object to transform the data to fit minmax processor
x_scaled = min_max_scaler.fit_transform(x)

# Run the normalizer on the dataframe
df8_normalized = pd.DataFrame(x_scaled)

print("Normalized total for male")
df8_normalized.sum()

Normalized total for male

0    310.125
dtype: float64

In [28]:
# Create y, where y the 'scores' column's values as floats
y= df9[["Price"]].values.astype(float)

# Create a minimum and maximum processor object
min_max_scaler = preprocessing.MinMaxScaler()

# Create an object to transform the data to fit minmax processor
y_scaled = min_max_scaler.fit_transform(y)

# Run the normalizer on the dataframe
df9_normalized = pd.DataFrame(y_scaled)

print("Normalized total for Female")
df9_normalized.sum()

Normalized total for Female

0    61.946429
dtype: float64

In [29]:
#Age Demographics
print(my_file["Age"].max())
print(my_file["Age"].min())

45
7

In [30]:
#create bins
bins=[1,10,14,18,22,26,30,34,38,42,46,50]
#create labels
group_labels=["1 to 10", "10 to 14", "14 to 18","18 to 22", "22 to 26", "26 to 30",
             "30 to 34", "34 to 38", "38 to 42", "42 to 46", "46 to 50"]

In [31]:
pd.cut(my_file["Age"], bins , labels = group_labels).head()

0    34 to 38
1    18 to 22
2    30 to 34
3    18 to 22
4    22 to 26
Name: Age, dtype: category
Categories (11, object): [1 to 10 < 10 to 14 < 14 to 18 < 18 to 22 ... 34 to 38 < 38 to 42 < 42 to 46 < 46 to 50]

In [32]:
#slice the data
my_file["Age_group"] =pd.cut(my_file["Age"], bins , labels = group_labels)
my_file.head()

,Age,Gender,Item ID,Item Name,Price,SN,Age_group
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34,34 to 38
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46,18 to 22
2,34,Male,174,Primitive Blade,2.46,Assastnya25,30 to 34
3,21,Male,92,Final Critic,1.36,Pheusrical25,18 to 22
4,23,Male,63,Stormfury Mace,1.27,Aela59,22 to 26

In [33]:
# counting the numbers in the bins
my_group=my_file.groupby("Age_group")
print(my_group["Price"].count())

Age_group
1 to 10      32
10 to 14     31
14 to 18    111
18 to 22    231
22 to 26    207
26 to 30     63
30 to 34     46
34 to 38     37
38 to 42     20
42 to 46      2
46 to 50      0
Name: Price, dtype: int64

In [34]:
#calculating the mean
print(my_group["Price"].mean())

Age_group
1 to 10     3.019375
10 to 14    2.702903
14 to 18    2.876757
18 to 22    2.927273
22 to 26    2.937295
26 to 30    2.983968
30 to 34    3.070435
34 to 38    2.812432
38 to 42    3.128000
42 to 46    3.265000
46 to 50         NaN
Name: Price, dtype: float64

In [35]:
# calculating the sum
print(my_group["Price"].sum())

Age_group
1 to 10      96.62
10 to 14     83.79
14 to 18    319.32
18 to 22    676.20
22 to 26    608.02
26 to 30    187.99
30 to 34    141.24
34 to 38    104.06
38 to 42     62.56
42 to 46      6.53
46 to 50      0.00
Name: Price, dtype: float64

In [36]:
#*****Identify the the top 5 spenders by total purchase price

cust_count=my_file["SN"].value_counts()
cust_group=my_file.groupby(["SN"])
cust_price=cust_group["Price"].sum()
tot_price=my_file["Price"].sum()
avg_price=(cust_price)/(tot_price)
summary= pd.DataFrame({"Purchase Count":cust_count,
                      "Total Purchase Price":cust_price, 
                      "Average Purchase Price":avg_price})

In [37]:
summary_df=summary.sort_values(["Total Purchase Price"],ascending=False)
summary_df.head()

             Purchase Count  Total Purchase Price  Average Purchase Price
Undirrala66               5                 17.06                0.007462
Saedue76                  4                 13.56                0.005931
Mindimnya67               4                 12.74                0.005572
Haellysu29                3                 12.73                0.005568
Eoda93                    3                 11.58                0.005065

In [38]:
#To find the Most Popular Items, 
#group the data by 'Item ID' & 'Item Name' to find which item was sold the most

item_group=my_file.groupby("Item ID")
item_id= pd.DataFrame(item_group["Item Name"].value_counts())
item_price=pd.DataFrame(item_group["Price"].value_counts())

In [39]:
#The create two tables show that the same item id was popular
# Rename the column approperiately

item_id=item_id.rename(columns={"Item Name":"Purchase Count"})
item_id2=item_price.rename(columns={"Price":"Purchase Count"})

In [40]:
#view the most popular item with sorting
item_sort=item_id.sort_values(["Purchase Count"], ascending=False)
item_sorted1 = item_sort.reset_index()
item_sorted1.head()

   Item ID                             Item Name  Purchase Count
0       39  Betrayal, Whisper of Grieving Widows              11
1       84                            Arcane Gem              11
2       31                             Trickster               9
3      175            Woeful Adamantite Claymore               9
4       13                              Serenity               9

In [41]:
#view the most popular item price
item_sort2=item_id2.sort_values(["Purchase Count"],ascending=False)
item_sorted2 = item_sort2.reset_index()
item_sorted2.head()

   Item ID  Price  Purchase Count
0       39   2.35              11
1       84   2.23              11
2       31   2.07               9
3      175   1.24               9
4       13   1.49               9

In [42]:
#merge the two tables and rename them aproperiately and delete unwanted column
merge_table = pd.merge(item_sorted1, item_sorted2, on="Item ID")

In [43]:
renamed_df=merge_table.rename(columns={"Purchase Count_y": " Purchase_Count"})

In [44]:
del renamed_df['Purchase Count_x']

In [45]:
renamed_df.head()

   Item ID                             Item Name  Price   Purchase_Count
0       39  Betrayal, Whisper of Grieving Widows   2.35               11
1       84                            Arcane Gem   2.23               11
2       31                             Trickster   2.07                9
3      175            Woeful Adamantite Claymore   1.24                9
4       13                              Serenity   1.49                9

In [46]:
#check the data type if it can be properly multiplied
renamed_df.dtypes

Item ID              int64
Item Name           object
Price              float64
 Purchase_Count      int64
dtype: object

In [47]:
# Reorganizing the columns using double brackets
organized_df = renamed_df[["Item ID","Item Name","Price"," Purchase_Count"]]
organized_df.head()

   Item ID                             Item Name  Price   Purchase_Count
0       39  Betrayal, Whisper of Grieving Widows   2.35               11
1       84                            Arcane Gem   2.23               11
2       31                             Trickster   2.07                9
3      175            Woeful Adamantite Claymore   1.24                9
4       13                              Serenity   1.49                9

In [48]:
#Reorganize the summary table
renamed_df["Total Purchase"] = renamed_df['Price']*renamed_df[' Purchase_Count']
renamed_df.head()

,Item ID,Item Name,Price,Purchase_Count,Total Purchase
0,39,"Betrayal, Whisper of Grieving Widows",2.35,11,25.85
1,84,Arcane Gem,2.23,11,24.53
2,31,Trickster,2.07,9,18.63
3,175,Woeful Adamantite Claymore,1.24,9,11.16
4,13,Serenity,1.49,9,13.41

In [49]:
#To find most Profitable Item, we just have to sort the total purchase column and find the max value
renamed_dfa=renamed_df.sort_values(["Total Purchase"],ascending=False)
renamed_dfa.head()

,Item ID,Item Name,Price,Purchase_Count,Total Purchase
5,34,Retribution Axe,4.14,9,37.26
13,115,Spectral Diamond Doomblade,4.25,7,29.75
39,32,Orenmir,4.95,6,29.70
24,103,Singed Scalpel,4.87,6,29.22
9,107,"Splitter, Foe Of Subtlety",3.61,8,28.88

Observable trends include:
-In terms of Gender Males are the most prominent buyers

-In age group 18 - 22 years old the most frequent customers.

-The most profitable item's are not the most popular items.